# ShowFooterCount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleSortGroupField..::..ShowFooterCount Property
ScheduleSortGroupField Class See Also
---
Indicates if the footer row should display a count of elements in the group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ShowFooterCount { get; set; }
```

Visual Basic
---
```text
Public Property ShowFooterCount As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowFooterCount {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if an element count should be displayed, false otherwise.
# Remarks
ShowFooterCount can only be enabled if ShowFooter is enabled.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: Display of footer rows is not enabled. |

# See Also
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace